**Задание 1**
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [35]:
%%time

data = pd.read_table('ratings.dat', sep = ('::'), names=["userId", "movieId", "rating", "timestamp"], engine='python')
data.head()

Wall time: 48.7 s

   userId  movieId  rating  timestamp
0       1      122     5.0  838985046
1       1      185     5.0  838983525
2       1      231     5.0  838983392
3       1      292     5.0  838983421
4       1      316     5.0  838983392

In [36]:
data2 = pd.read_table('movies.dat', sep = ('::'), names=["movieId", "title", "genres"], engine='python')
data2.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [37]:
total = data2.merge(data, how = 'left', left_on='movieId', right_on='movieId')
total.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5.0,1.0,8.579113e+08
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,14.0,3.0,1.133572e+09
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,18.0,3.0,1.111546e+09
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,23.0,5.0,8.495435e+08
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,24.0,5.0,8.682542e+08

In [59]:
total[ (total['rating'] == 5.0)]['title'].value_counts().head(1)

Shawshank Redemption, The (1994)    16460
Name: title, dtype: int64

**Задание 2** По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [41]:
import pandas as pd

power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [45]:
filtered_countries = power[ (power['country']=='Lithuania') | (power['country']=='Latvia') | (power['country']=='Estonia') ]

filtered_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [70]:
f_categ = filtered_countries[ (filtered_countries['category'] == 4 ) | (filtered_countries['category'] == 12 )| (filtered_countries['category'] == 21)]
f_categ.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [79]:
f_y_categ = f_categ[ (f_categ['year'] >= 2005 ) & (f_categ['year'] <= 2010 ) & (f_categ['quantity'] >= 0 ) ]
f_y_categ.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [82]:
f_y_categ['quantity'].sum()

240580.0

**Задание 3** Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [107]:
import pandas as pd

df = pd.read_html('https://vawilon.ru/statistika-pogody/', header=0, encoding='utf-8')
df[0]

  Время года Температура днем (°C) Температура ночью (°C)
0       Зима                 10–20                   5–12
1      Весна                 20–30                  15–20
2       Лето                 25–45                  25–35
3      Осень                 15–25                  15–20